laurigates/mcu-tinkering-lab/packages/robocar/unified/sdkconfig.defaults
# XIAO ESP32-S3 Sense Unified Robocar Configuration

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (XIAO ESP32-S3 Sense has 8MB Octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_CSI_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y

# mbedTLS buffers in PSRAM. The default (internal) allocator gives every TLS
# connection a 16 kB RX buffer plus handshake state from internal RAM, and the
# planner, TTS stream and voice turn each hold their own connection. Overlapping
# handshakes ran internal RAM down to 259 bytes (min_ever, logged by
# gemini_http.c) and failed with -0x7F00 / -0x2880 / -0x0010 *_ALLOC_FAILED —
# which presented as a robot that "does not hear": the voice turn recorded fine
# and then never reached Gemini.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Camera (DMA on Core 1 to isolate from motor control on Core 0)
CONFIG_CAMERA_CORE1=y
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768
# JPEG framebuffer size. The default AUTO mode computes width*height/5, which at
# QVGA is a hard 15360-byte ceiling: cam_hal.c's FB-OVF guard aborts accumulation
# past it, the truncated frame is still queued, cam_take then finds no EOI marker
# and retries until esp_camera_fb_get()'s 4 s timeout — surfacing as "Camera
# capture failed" and a forced STOP. A detailed or bright scene routinely exceeds
# 15 kB at quality 15, and raising the AGC gain ceiling makes it worse (noise
# inflates JPEG size). 64 kB in PSRAM is nothing against 8 MB.
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_AUTO=n
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=65536
# Camera SCCB must use the NEW I2C driver ("driver_ng"). i2cdev 2.1.2 (the
# esp-idf-lib driver behind i2c_bus.c: TCA9548A + PCA9685 + MCP23017) migrated
# to i2c_new_master_bus() a while back, and ESP-IDF 5.4 will not link the
# legacy driver/i2c.h API into the same binary as the new one at all — the
# check is a whole-firmware constructor, not a per-port runtime check, so it
# fires even though SCCB (I2C1) and i2cdev's bus (I2C0) are different
# peripherals. Violating this aborts at boot with "CONFLICT! driver_ng is not
# allowed to be used with this old driver". Keep this in sync with whichever
# driver i2cdev is on — if i2cdev is ever pinned back to a pre-2.0 legacy
# release, this must flip back to LEGACY.
CONFIG_SCCB_HARDWARE_I2C_DRIVER_NEW=y
CONFIG_SCCB_HARDWARE_I2C_PORT1=y

# Flash (XIAO ESP32-S3 Sense has 8MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom OTA partition table (partitions.csv).
# ESP-IDF ignores set(CONFIG_PARTITION_TABLE_* ...) in CMakeLists — sdkconfig
# is authoritative — so these MUST live here or the build falls back to the
# default single-app 1M factory table and the binary overflows it.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# USB Serial/JTAG console (XIAO native USB-C)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Power Management - Disable brownout detector
CONFIG_ESP_BROWNOUT_DET=n

# OTA Support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# OTA GitHub configuration defaults
CONFIG_OTA_GITHUB_ORG="laurigates"
CONFIG_OTA_GITHUB_REPO="mcu-tinkering-lab"

# mDNS (robocar-unified.local) needs no Kconfig switch — it is pulled in as the
# espressif/mdns managed component. There is no CONFIG_MDNS_ENABLED symbol; a
# line setting one is silently ignored by the build.

# MCP23017 GPIO expander (I2C variant of the mcp23x17 driver)
CONFIG_MCP23X17_IFACE_I2C=y

# Heap configuration (disable advanced features)
CONFIG_HEAP_TRACING=n
CONFIG_HEAP_TASK_TRACKING=n
CONFIG_HEAP_POISONING_DISABLED=y
